<?php
// +----------------------------------------------------------------------
// | OpenCMF [ Simple Efficient Excellent ]
// +----------------------------------------------------------------------
// | Copyright (c) 2014 http://www.youfai.cn All rights reserved.
// +----------------------------------------------------------------------
// | Author: <youfai@youfai.cn>
// +----------------------------------------------------------------------
return array(
    'appp_init' => array(
        'app\\app\\behavior\\adminBehavior', //初始化系统配置行为扩展
    ),
);
